blog/2018/08/13/docker-machine初体验/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>docker-machine初体验 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="linux和它的小伙伴,docker" />
  <link rel="stylesheet" media="screen" href="/media/css/font.css" rel="stylesheet" type="text/css"/>
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="/">暗无天日</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
              <li><a href="/years/">Years</a></li>
              <li><a href="/authors/">Authors</a></li>
              <li><a href="/tags/">Tags</a></li>
              <li><a href="/about/">About</a></li>
              <li><a href="https://github.com/lujun9972/lujun9972.github.com">Github</a></li>
              <li><a href="/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
        <input type="text" class="field" name="q" id="s" placeholder="Search">
        <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">docker-machine初体验</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde68334">在本地创建带Docker的虚拟机</a></li>
<li><a href="#org5e617da">在远程主机上安装Docker</a></li>
<li><a href="#org48a47a4">管理Docker Machine</a>
<ul>
<li><a href="#org7424644">查看被管主机信息</a></li>
<li><a href="#orgf822112">升级被管主机</a></li>
<li><a href="#org6b4b4d0">停止被管主机</a></li>
<li><a href="#org6e2d677">启动被管主机</a></li>
<li><a href="#org627cd05">删除被管主机</a></li>
<li><a href="#org24013ee">管理远程Docker</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Docker Machine是Docker官方提供的一个帮助我们在远程机器上安装Docker和在本地安装带Docker的虚拟机的工具。
我们还可以通过docker=machine命令来对远程主机的Docker进行管理。
</p>

<p>
Docker Machine自带了很多驱动，这些驱动将不同的虚拟机引擎与云服务商与Docker Machine整合在一起。
Docker Machine自带的驱动有:
</p>
<pre class="example">
amazonec2        digitalocean     generic          hyperv           rackspace        virtualbox       vmwarevcloudair
azure            exoscale         google           openstack        softlayer        vmwarefusion     vmwarevsphere
</pre>

<div id="outline-container-orgde68334" class="outline-2">
<h2 id="orgde68334">在本地创建带Docker的虚拟机</h2>
<div class="outline-text-2" id="text-orgde68334">
<p>
通过 <code>docker-machine create</code> 命令可以创建主机并安装虚拟机，比如下面命令会创建三个使用VirtualBox驱动的主机并且在每台主机上安装好Docker
</p>
<div class="org-src-container">
<pre class="src src-shell">docker-machine create --driver virtualbox host1
docker-machine create --driver virtualbox host2
docker-machine create --driver virtualbox host3
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Running pre-create checks...
Creating machine...
(host1) Copying <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/cache/boot2docker.iso to <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/machines/host1/boot2docker.iso...
(host1) Creating VirtualBox VM...
(host1) Creating SSH key...
(host1) Starting the VM...
(host1) Check network to re-create if needed...
(host1) Waiting for an IP...
Waiting for machine to be running, this may take a few minutes...
Detecting operating system of created instance...
Waiting for SSH to be available...
Detecting the provisioner...
Provisioning with boot2docker...
Copying certs to the local machine directory...
Copying certs to the remote machine...
Setting Docker configuration on the remote daemon...
Checking connection to Docker...
Docker is up and running!
To see how to connect your Docker Client to the Docker Engine running on this virtual machine, run: docker-machine env host1
Running pre-create checks...
Creating machine...
(host2) Copying <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/cache/boot2docker.iso to <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/machines/host2/boot2docker.iso...
(host2) Creating VirtualBox VM...
(host2) Creating SSH key...
(host2) Starting the VM...
(host2) Check network to re-create if needed...
(host2) Waiting for an IP...
Waiting for machine to be running, this may take a few minutes...
Detecting operating system of created instance...
Waiting for SSH to be available...
Detecting the provisioner...
Provisioning with boot2docker...
Copying certs to the local machine directory...
Copying certs to the remote machine...
Setting Docker configuration on the remote daemon...
Checking connection to Docker...
Docker is up and running!
To see how to connect your Docker Client to the Docker Engine running on this virtual machine, run: docker-machine env host2
Running pre-create checks...
Creating machine...
(host3) Copying <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/cache/boot2docker.iso to <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/machines/host3/boot2docker.iso...
(host3) Creating VirtualBox VM...
(host3) Creating SSH key...
(host3) Starting the VM...
(host3) Check network to re-create if needed...
(host3) Waiting for an IP...
Waiting for machine to be running, this may take a few minutes...
Detecting operating system of created instance...
Waiting for SSH to be available...
Detecting the provisioner...
Provisioning with boot2docker...
Copying certs to the local machine directory...
Copying certs to the remote machine...
Setting Docker configuration on the remote daemon...
Checking connection to Docker...
Docker is up and running!
To see how to connect your Docker Client to the Docker Engine running on this virtual machine, run: docker-machine env host3
</pre>
</div>

<p>
同时，你会发现virtualbox创建了名为host1,host2,host3的三台主机
</p>
<div class="org-src-container">
<pre class="src src-shell">vboxmanage list vms
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">"winxp_default_1529148278389_22373" {5d100a8e-a670-4f84-8ea4-eb22f3dab94d}
"win7" {dddcdefb-5002-4bcd-bef2-ee37f0ba6197}
"rhel7.5" {bbf01330-070b-4663-b8e3-52734297c112}
"redis-host" {f5576790-7d12-4ee8-884f-7352c04f4e04}
"rhel_default_1532386536492_17873" {449040f4-21ef-436d-8648-a4026a547875}
"centos_default_1532472936791_11249" {86ffd1ee-681a-4062-a233-e29ac966fc81}
"freebsd" {2924b43b-da8b-4f59-ac32-ee4420923055}
"RHEL7" {33e98062-f82e-49df-9a8a-91b0eb31e80d}
"arch_default_1532990644081_68335" {2d5206ba-c07a-4691-8c3b-63e941113f15}
"ctf-tools_default_1533510374954_98487" {edd5c5d6-95e5-47af-a462-1d66aab8e640}
"host1" {ee738687-3981-4582-b2d3-3540a1cbff1c}
"host2" {d2907cef-5018-4476-a6e8-5e7c1c321cfe}
"host3" {222d485e-26c2-46e8-bc6e-cfc490d4c34a}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e617da" class="outline-2">
<h2 id="org5e617da">在远程主机上安装Docker</h2>
<div class="outline-text-2" id="text-org5e617da">
<p>
若远程主机是在Docker Machine支持的云服务商的，那么可以直接通过对应的驱动来帮助安装Docker，方法跟上面很类似。
</p>

<p>
然若远程主机并不是在云服务商上，或者是Docker Machine所不支持的云服务商，那么可以通过 <code>generic</code> 驱动来进行安装。
</p>

<p>
在使用 <code>generic</code> 进行远程安装前，我们需要一些准备工作:
</p>

<ol class="org-ol">
<li><p>
在目标主机创建一个无需输入密码即可sudo操作的用户
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo adduser $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">user</span><span style="color: #4f97d7;">}</span>
sudo usermod -a -G sudo wheel $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">user</span><span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"${user} ALL=(ALL:ALL) NOPASSWD: ALL"</span> &gt;&gt;/etc/sudoers
</pre>
</div></li>

<li><p>
在目标主机上添加密钥认证，使得登陆远程主机不同输入密码
</p>
<div class="org-src-container">
<pre class="src src-shell">ssh-copy-id $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">user</span><span style="color: #4f97d7;">}</span>@$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">remote_host</span><span style="color: #4f97d7;">}</span>
</pre>
</div></li>
</ol>


<p>
准备工作完成后，我们可以在本地主机上运行下面命令
</p>
<div class="org-src-container">
<pre class="src src-shell">docker-machine create -d generic <span style="color: #2d9574;">\</span>
    --generic-ip-address=xxx.xxx.xxx.xxx <span style="color: #2d9574;">\</span>
    --generic-ssh-user=$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">user</span><span style="color: #4f97d7;">}</span> <span style="color: #2d9574;">\</span>
    --generic-ssh-key ~/.ssh/id_rsa <span style="color: #2d9574;">\</span>
    $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">name</span><span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
其中 <code>${name}</code> 就是 Docker-Machine 用来管理目标主机上Docker的一个指代名称。
</p>
</div>
</div>
