linux和它的小伙伴/docker-machine初体验.org
** 查看被管主机信息
Docker Machine可以用来列出、检查和升级被管主机，我们可以通过 =ls= 子命令来获得被管理的机器列表
#+BEGIN_SRC shell :results org
  docker-machine ls
#+END_SRC

#+BEGIN_SRC org
NAME         ACTIVE   DRIVER       STATE     URL                         SWARM   DOCKER        ERRORS
host1        -        virtualbox   Running   tcp://192.168.99.100:2376           v18.06.0-ce   
host2        -        virtualbox   Running   tcp://192.168.99.101:2376           v18.06.0-ce   
host3        -        virtualbox   Running   tcp://192.168.99.102:2376           v18.06.0-ce   
redis-host   -        virtualbox   Stopped                                       Unknown       
#+END_SRC

这个命令列出了每台被管主机的名称、创建时的驱动、状态、以及Docker Daemon访问的URL。
ACTIVE这一列若带星号，则表示这台机器是活跃的，也就是任何在本地运行的docker命令连接上的都是活跃机器上的Docker Daemon。

类似于 =docker=, 我们也可以使用 =inspect= 子命令来查看某台主机的配置
#+BEGIN_SRC shell :results org
  docker-machine inspect --format "{{.Driver.IPAddress}}" host2
#+END_SRC

#+BEGIN_SRC org
192.168.99.101
#+END_SRC

当然，如果只是想看被管主机IP，那么可以直接通过 =ip= 子命令来查看
#+BEGIN_SRC shell :results org
  docker-machine ip host2
#+END_SRC

#+BEGIN_SRC org
192.168.99.101
#+END_SRC


** 升级被管主机
#+BEGIN_SRC shell :results org
  docker-machine upgrade host1
#+END_SRC

#+BEGIN_SRC org
Waiting for SSH to be available...
Detecting the provisioner...
Upgrading docker...
Stopping machine to do the upgrade...
Upgrading machine "host1"...
Copying /home/lujun9972/.docker/machine/cache/boot2docker.iso to /home/lujun9972/.docker/machine/machines/host1/boot2docker.iso...
Starting machine back up...
(host1) Check network to re-create if needed...
(host1) Waiting for an IP...
Restarting docker...
#+END_SRC

** 停止被管主机
使用 =stop= 子命令来停止被管主机
#+BEGIN_SRC shell :results org
  docker-machine stop host2
#+END_SRC

#+BEGIN_SRC org
Stopping "host2"...
Machine "host2" was stopped.
#+END_SRC

如果使用 =stop= 子命令迟迟无法关闭被管主机，那么也可以直接使用 =kill= 命令来强制关机

** 启动被管主机
使用 =start= 子命令来启动被停止的主机
#+BEGIN_SRC shell :results org
  docker-machine start host2
#+END_SRC

#+BEGIN_SRC org
Starting "host2"...
(host2) Check network to re-create if needed...
(host2) Waiting for an IP...
Machine "host2" was started.
Waiting for SSH to be available...
Detecting the provisioner...
Started machines may have new IP addresses. You may need to re-run the `docker-machine env` command.
#+END_SRC

** 删除被管主机
使用 =rm= 子命令来删除被管主机
#+BEGIN_SRC shell :results org
  yes|docker-machine rm host3
#+END_SRC

#+BEGIN_SRC org
About to remove host3
WARNING: This action will delete both local reference and remote instance.
Are you sure? (y/n): Successfully removed host3
#+END_SRC

再次查看一下virtualbox还剩下哪些主机
#+BEGIN_SRC shell :results org
  vboxmanage list vms
#+END_SRC 

#+BEGIN_SRC org
"winxp_default_1529148278389_22373" {5d100a8e-a670-4f84-8ea4-eb22f3dab94d}
"win7" {dddcdefb-5002-4bcd-bef2-ee37f0ba6197}
"rhel7.5" {bbf01330-070b-4663-b8e3-52734297c112}
"redis-host" {f5576790-7d12-4ee8-884f-7352c04f4e04}
"rhel_default_1532386536492_17873" {449040f4-21ef-436d-8648-a4026a547875}
"centos_default_1532472936791_11249" {86ffd1ee-681a-4062-a233-e29ac966fc81}
"freebsd" {2924b43b-da8b-4f59-ac32-ee4420923055}
"RHEL7" {33e98062-f82e-49df-9a8a-91b0eb31e80d}
"arch_default_1532990644081_68335" {2d5206ba-c07a-4691-8c3b-63e941113f15}
"ctf-tools_default_1533510374954_98487" {edd5c5d6-95e5-47af-a462-1d66aab8e640}
"host1" {ee738687-3981-4582-b2d3-3540a1cbff1c}
"host2" {d2907cef-5018-4476-a6e8-5e7c1c321cfe}
#+END_SRC

host3虚拟机被干掉了。

