blog/2018/08/13/docker-machine初体验/index.html

<div id="outline-container-org48a47a4" class="outline-2">
<h2 id="org48a47a4">管理Docker Machine</h2>
<div class="outline-text-2" id="text-org48a47a4">
</div>
<div id="outline-container-org7424644" class="outline-3">
<h3 id="org7424644">查看被管主机信息</h3>
<div class="outline-text-3" id="text-org7424644">
<p>
Docker Machine可以用来列出、检查和升级被管主机，我们可以通过 <code>ls</code> 子命令来获得被管理的机器列表
</p>
<div class="org-src-container">
<pre class="src src-shell">docker-machine ls
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">NAME         ACTIVE   DRIVER       STATE     URL                         SWARM   DOCKER        ERRORS
host1        -        virtualbox   Running   tcp://192.168.99.100:2376           v18.06.0-ce   
host2        -        virtualbox   Running   tcp://192.168.99.101:2376           v18.06.0-ce   
host3        -        virtualbox   Running   tcp://192.168.99.102:2376           v18.06.0-ce   
redis-host   -        virtualbox   Stopped                                       Unknown       
</pre>
</div>

<p>
这个命令列出了每台被管主机的名称、创建时的驱动、状态、以及Docker Daemon访问的URL。
ACTIVE这一列若带星号，则表示这台机器是活跃的，也就是任何在本地运行的docker命令连接上的都是活跃机器上的Docker Daemon。
</p>

<p>
类似于 <code>docker</code>, 我们也可以使用 <code>inspect</code> 子命令来查看某台主机的配置
</p>
<div class="org-src-container">
<pre class="src src-shell">docker-machine inspect --format <span style="color: #2d9574;">"{{.Driver.IPAddress}}"</span> host2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">192.168.99.101
</pre>
</div>

<p>
当然，如果只是想看被管主机IP，那么可以直接通过 <code>ip</code> 子命令来查看
</p>
<div class="org-src-container">
<pre class="src src-shell">docker-machine ip host2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">192.168.99.101
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf822112" class="outline-3">
<h3 id="orgf822112">升级被管主机</h3>
<div class="outline-text-3" id="text-orgf822112">
<div class="org-src-container">
<pre class="src src-shell">docker-machine upgrade host1
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Waiting for SSH to be available...
Detecting the provisioner...
Upgrading docker...
Stopping machine to do the upgrade...
Upgrading machine "host1"...
Copying <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/cache/boot2docker.iso to <span style="font-style: italic;">/home/lujun9972/</span>.docker/machine/machines/host1/boot2docker.iso...
Starting machine back up...
(host1) Check network to re-create if needed...
(host1) Waiting for an IP...
Restarting docker...
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b4b4d0" class="outline-3">
<h3 id="org6b4b4d0">停止被管主机</h3>
<div class="outline-text-3" id="text-org6b4b4d0">
<p>
使用 <code>stop</code> 子命令来停止被管主机
</p>
<div class="org-src-container">
<pre class="src src-shell">docker-machine stop host2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Stopping "host2"...
Machine "host2" was stopped.
</pre>
</div>

<p>
如果使用 <code>stop</code> 子命令迟迟无法关闭被管主机，那么也可以直接使用 <code>kill</code> 命令来强制关机
</p>
</div>
</div>

<div id="outline-container-org6e2d677" class="outline-3">
<h3 id="org6e2d677">启动被管主机</h3>
<div class="outline-text-3" id="text-org6e2d677">
<p>
使用 <code>start</code> 子命令来启动被停止的主机
</p>
<div class="org-src-container">
<pre class="src src-shell">docker-machine start host2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">Starting "host2"...
(host2) Check network to re-create if needed...
(host2) Waiting for an IP...
Machine "host2" was started.
Waiting for SSH to be available...
Detecting the provisioner...
Started machines may have new IP addresses. You may need to re-run the `docker-machine env` command.
</pre>
</div>
</div>
</div>

<div id="outline-container-org627cd05" class="outline-3">
<h3 id="org627cd05">删除被管主机</h3>
<div class="outline-text-3" id="text-org627cd05">
<p>
使用 <code>rm</code> 子命令来删除被管主机
</p>
<div class="org-src-container">
<pre class="src src-shell">yes|docker-machine rm host3
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">About to remove host3
WARNING: This action will delete both local reference and remote instance.
Are you sure? (y/n): Successfully removed host3
</pre>
</div>

<p>
再次查看一下virtualbox还剩下哪些主机
</p>
<div class="org-src-container">
<pre class="src src-shell">vboxmanage list vms
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">"winxp_default_1529148278389_22373" {5d100a8e-a670-4f84-8ea4-eb22f3dab94d}
"win7" {dddcdefb-5002-4bcd-bef2-ee37f0ba6197}
"rhel7.5" {bbf01330-070b-4663-b8e3-52734297c112}
"redis-host" {f5576790-7d12-4ee8-884f-7352c04f4e04}
"rhel_default_1532386536492_17873" {449040f4-21ef-436d-8648-a4026a547875}
"centos_default_1532472936791_11249" {86ffd1ee-681a-4062-a233-e29ac966fc81}
"freebsd" {2924b43b-da8b-4f59-ac32-ee4420923055}
"RHEL7" {33e98062-f82e-49df-9a8a-91b0eb31e80d}
"arch_default_1532990644081_68335" {2d5206ba-c07a-4691-8c3b-63e941113f15}
"ctf-tools_default_1533510374954_98487" {edd5c5d6-95e5-47af-a462-1d66aab8e640}
"host1" {ee738687-3981-4582-b2d3-3540a1cbff1c}
"host2" {d2907cef-5018-4476-a6e8-5e7c1c321cfe}
</pre>
</div>

<p>
host3虚拟机被干掉了。
</p>
</div>
</div>
